"""
UTF-8
This is config file, all dictionaries for encoding and decoding ciphers are written here.
MORSE CODE:
"""
import string

MORSE_CODE_EN_CODE: dict[str:str] = {'a': '.—', 'b': '—...', 'c': '—.—.', 'd': '—..',
                                     'e': '.', 'f': '..—.', 'g': '——.', 'h': '....',
                                     'i': '..', 'j': '.———', 'k': '—.—', 'l': '.—..',
                                     'm': '——', 'n': '—.', 'o': '———', 'p': '.——.',
                                     'q': '——.—', 'r': '.—.', 's': '...', 't': '—',
                                     'u': '..—', 'v': '...—', 'w': '.——', 'x': '—..—',
                                     'y': '—.——', 'z': '——..'}

MORSE_CODE_RU_CODE: dict[str:str] = {'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.',
                                     'Д': '-..', 'Е': '.', 'Ж': '...-',
                                     'З': '--..', 'И': '..', 'Й': '.---', 'К': '-.-',
                                     'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---',
                                     'П': '.--.', 'Р': '.-.', 'С': '...', 'Т': '-',
                                     'У': '..-', 'Ф': '..-.', 'Х': '....', 'Ц': '-.-.',
                                     'Ч': '---.', 'Ш': '----', 'Щ': '--.-', 'Ъ': '--.--',
                                     'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--',
                                     'Я': '.-.-'}

MORSE_CODE_NUMBERS_CODE: dict[str:str] = {'0': '-----', '1': '.----', '2': '..---',
                                          '3': '...--', '4': '....-', '5': '.....',
                                          '6': '-....', '7': '--...', '8': '---..',
                                          '9': '----.'}

MORSE_CODE_SYMBOLS_CODE: dict[str:str] = {".": ".-.-.-",
                                          ",": "--..--",
                                          ":": "---...",
                                          ";": "-.-.-.",
                                          "?": "..--..",
                                          "-": "-....-",
                                          "_": "..--.-",
                                          "(": "-.--.",
                                          ")": "-.--.-",
                                          "'": ".----.",
                                          "=": "-...-",
                                          "+": ".-.-.",
                                          "/": "-..-.",
                                          "@": ".--.-.",
                                          "!": "-.-.--",
                                          " ": "/"}

MORSE_CODE_EN_LANGUAGE: dict[str:str] = {'.—': 'a', '—...': 'b', '—.—.': 'c', '—..': 'd', '.': 'e', '..—.': 'f',
                                         '——.': 'g', '....': 'h', '..': 'i', '.———': 'j', '—.—': 'k', '.—..': 'l',
                                         '——': 'm', '—.': 'n', '———': 'o', '.——.': 'p', '——.—': 'q', '.—.': 'r',
                                         '...': 's', '—': 't', '..—': 'u', '...—': 'v', '.——': 'w', '—..—': 'x',
                                         '—.——': 'y', '——..': 'z'}

MORSE_CODE_RU_LANGUAGE: dict[str:str] = {'.-': 'А', '-...': 'Б', '.--': 'В', '--.': 'Г', '-..': 'Д', '.': 'Е',
                                         '...-': 'Ж', '--..': 'З', '..': 'И', '.---': 'Й', '-.-': 'К', '.-..': 'Л',
                                         '--': 'М', '-.': 'Н', '---': 'О', '.--.': 'П', '.-.': 'Р', '...': 'С',
                                         '-': 'Т', '..-': 'У', '..-.': 'Ф', '....': 'Х', '-.-.': 'Ц', '---.': 'Ч',
                                         '----': 'Ш', '--.-': 'Щ', '--.--': 'Ъ', '-.--': 'Ы', '-..-': 'Ь', '..-..': 'Э',
                                         '..--': 'Ю', '.-.-': 'Я'}

MORSE_CODE_NUMBERS_LANGUAGE: dict[str:str] = {'-----': '0', '.----': '1', '..---': '2', '...--': '3', '....-': '4',
                                              '.....': '5', '-....': '6', '--...': '7', '---..': '8', '----.': '9'}

MORSE_CODE_SYMBOLS_LANGUAGE: dict[str:str] = {'.-.-.-': '.', '--..--': ',', '---...': ':', '-.-.-.': ';', '..--..': '?',
                                              '-....-': '-', '..--.-': '_', '-.--.': '(', '-.--.-': ')', '.----.': "'",
                                              '-...-': '=', '.-.-.': '+', '-..-.': '/', '.--.-.': '@', '/': " ",
                                              "-.-.--": "!"}


# This is a single dictionary where all morse ciphers are collected

MORSE_CODES_DICT: dict = {
    "RU":
        {
            "DECODE": MORSE_CODE_RU_LANGUAGE, "ENCODE": MORSE_CODE_RU_CODE
        },
    "EN":
        {
            "DECODE": MORSE_CODE_EN_LANGUAGE, "ENCODE": MORSE_CODE_EN_CODE
        },
    "NUM":
        {
            "DECODE": MORSE_CODE_NUMBERS_LANGUAGE, "ENCODE": MORSE_CODE_NUMBERS_CODE
        },
    "SYM":
        {
            "DECODE": MORSE_CODE_SYMBOLS_LANGUAGE, "ENCODE": MORSE_CODE_SYMBOLS_CODE
        }
}


# This is a single dictionary where all letters are collected

CAESAR_LETTERS_DICT: dict = {
    "RU": "абвгдеёжзийклмнопрстуфхцчшщъыьэюя",
    "EN": string.ascii_letters,
    "NUM": string.digits
}
